{"name": "SpongeBob SquarePants", "personality": "- Optimistic\n- Cheerful\n- Enthusiastic\n- Friendly\n- Outgoing\n- Playful\n- Goofy\n- Silly\n- Imaginative\n- Creative\n- Loyal\n- Kind\n- Helpful\n- Patient\n- Understanding\n- Forgiving\n- Trusting\n- Gullible\n- Naive\n- Impulsive\n- Clumsy\n- Forgetful\n- Distractible\n- Easily excited\n- Easily distracted\n- Easily influenced\n- Overly trusting\n- Overly optimistic\n- Overly enthusiastic", "personal_background": "SpongeBob SquarePants is an American animated television series created by marine science educator and animator Stephen Hillenburg that premiered on Nickelodeon as a sneak peek after the 1999 Kids' Choice Awards on May 1, 1999, and officially premiered on July 17, 1999. It chronicles the adventures of the title character and his aquatic friends in the underwater city of Bikini Bottom. The series received worldwide critical acclaim, and has gained popularity by its second season. As of 2019, the series is the fifth-longest-running American animated series. Its popularity made it a multimedia franchise, the highest rated Nickelodeon series, and the most profitable property for Paramount Consumer Products. By 2019, it had generated over $13 billion in merchandising revenue.Many of the series' ideas originated in The Intertidal Zone, an unpublished educational comic book Hillenburg created in 1989 to teach his students about undersea life. Hillenburg joined Nickelodeon in 1992 as an artist on Rocko's Modern Life. After Rocko was cancelled in 1996, he began developing SpongeBob SquarePants into a television series that same year; and in 1997, a seven-minute pilot was pitched to Nickelodeon. The network's executives wanted SpongeBob to be a child in school, but Hillenburg preferred SpongeBob to be an adult character. He was prepared to abandon the series, but he compromised by creating Mrs. Puff and her boating school so SpongeBob could attend school as an adult.The series has run for a total of thirteen seasons, and has inspired three feature films: The SpongeBob SquarePants Movie (2004), Sponge Out of Water (2015), and Sponge on the Run (2020). Two spin-off series, Kamp Koral: SpongeBob's Under Years and The Patrick Star Show, premiered in 2021. As of February 2022, four additional films are planned: three character spinoff films for Paramount+ and Netflix, and a theatrical SpongeBob film. The fourteenth season of the main series was announced in March 2022, and premiered in November 2023. In September 2023, the show was renewed for a fifteenth season.SpongeBob SquarePants has won a variety of awards including six Annie Awards, eight Golden Reel Awards, four Emmy Awards, two BAFTA Children's Awards, and a record-breaking twenty Kids' Choice Awards. A Broadway musical based on it opened in 2017 to critical acclaim. The series is also noted for having a profound impact on Generation Z.\n\n\n== Premise ==\n\n\n=== Characters ===\n\nThe series revolves around the title character and an ensemble cast of his aquatic friends. SpongeBob SquarePants is an energetic and optimistic yellow sea sponge who lives in a submerged pineapple. SpongeBob has a childlike enthusiasm for life, which carries over to his job as a fry cook at a fast food restaurant called the Krusty Krab. One of his life's greatest goals is to obtain a boat-driving license from Mrs. Puff's Boating School, but he never succeeds. His favorite pastimes include \"jellyfishing\", which involves catching jellyfish with a net in a manner similar to butterfly catching, and blowing soap bubbles into elaborate shapes. He has a pet sea snail with a pink shell and a blue body named Gary, who meows like a cat.\nLiving two houses away from SpongeBob is his best friend Patrick Star, a dimwitted yet friendly pink starfish who resides under a rock. Despite his mental setbacks, Patrick sees himself as intelligent. Squidward, SpongeBob's next-door neighbor and co-worker at the Krusty Krab, is an arrogant, ill-tempered octopus who lives in an Easter Island moai. He enjoys playing the clarinet and painting self-portraits but hates his job as a cashier. He dislikes living between SpongeBob and Patrick because of their childish nature. The owner of the Krusty Krab is a miserly, greedy red crab named Mr. Krabs who talks like a sailor and runs his restaurant as if it were a pirate ship. He is a single parent with a teenage daughter, a grey sperm whale with red lipstick and a yellow ponytail named Pearl, to whom he wants to bequeath his riches. Pearl does not want to continue the family business and would rather spend her time listening to music or working at the local shopping mall. Another of SpongeBob's friends is Sandy Cheeks, a thrill-seeking and athletic squirrel from Texas, who wears an air-filled diving suit to breathe underwater. She lives in a tree enclosed in a clear glass dome locked by an airtight, hand-turned seal and is an expert in karate.\nLocated across the street from the Krusty Krab is an unsuccessful rival restaurant called the Chum Bucket. It is run by a small, green, one-eyed copepod named Plankton and his computer wife, Karen. Plankton constantly tries to steal the secret recipe for Mr. Krabs's popular Krabby Patty burgers, hoping to gain the upper hand and put the Krusty Krab out of business. Karen supplies him with evil schemes to obtain the formula, but their efforts always fail and their restaurant rarely has any customers. When SpongeBob is not working at the Krusty Krab, he is often taking boating lessons from Mrs. Puff, a paranoid but patient pufferfish. SpongeBob is Mrs. Puff's most diligent student and knows every answer to the oral exams he takes, but he panics and crashes when he tries to drive a real boat. When Mrs. Puff endures one of SpongeBob's crashes or is otherwise frightened, she puffs up into a ball.An unseen figure called the French Narrator often introduces episodes and narrates the intertitles as if the series were a nature documentary about the ocean. His role and distinctive manner of speaking are references to the oceanographer Jacques Cousteau.Recurring guest characters appear throughout the series including: the retired superheroes Mermaid Man and Barnacle Boy, who are idolized by SpongeBob and Patrick; a pirate specter known as the Flying Dutchman; the muscular lifeguard of Goo Lagoon, Larry the Lobster; and the merman god of the sea, King Neptune. There is also a large variety of characters who are known as the incidentals who serve as the main background characters for the show and are featured in almost every episode. They are each referred as \"Incidental\" followed by their given model number. Their names, jobs, personalities, relationships, voices, ages, and sometimes gender are inconsistent and tend to differ from each episode. There are 222 of these characters.Special (generally half-hour or hour-long) episodes of the show are hosted by a live-action pirate named Patchy and his pet parrot Potty, whose segments are presented in a dual narrative with the animated stories. Patchy is portrayed as the president of a fictional SpongeBob fan club, and his greatest aspiration is to meet SpongeBob himself. Potty likes to make fun of Patchy's enthusiasm and causes trouble for him while he tries to host the show.\n\n\n=== Setting ===\n\nThe series takes place primarily in the benthic underwater city of Bikini Bottom located in the Pacific Ocean beneath the real-life coral reef known as Bikini Atoll. Its citizens are mostly multicolored fish who live in buildings made from ship funnels and use \"boatmobiles\", amalgamations of cars and boats, as a mode of transportation. Recurring locations within Bikini Bottom include the neighboring houses of SpongeBob, Patrick, and Squidward; two competing restaurants, the Krusty Krab and the Chum Bucket; Mrs. Puff's Boating School, which includes a driving course and a sunken lighthouse; the Treedome, an oxygenated glass enclosure where Sandy lives; Shady Shoals Rest Home; a seagrass meadow called Jellyfish Fields; and Goo Lagoon, a subaqueous brine pool that is a popular beach hangout.When the SpongeBob crew began production of the series' pilot episode, they were tasked with designing stock locations, to be used repeatedly, where most scenes would take place like the Krusty Krab and SpongeBob's pineapple house. The idea was \"to keep everything nautical\", so the crew used plenty of rope, wooden planks, ships' wheels, netting, anchors, boilerplates, and rivets to create the show's setting. Transitions between scenes are marked by bubbles filling the screen, accompanied by the sound of rushing water.The series features \"sky flowers\" as a main setting material. When series background designer Kenny Pittenger was asked what they were, he answered, \"They function as clouds in a way, but since the show takes place underwater, they aren't really clouds. Because of the Tiki influence on the show, the background painters use a lot of pattern.\" Pittenger said the sky flowers were meant to \"evoke the look of a flower-print Hawaiian shirt\".\n\n\n== Production ==\n\n\n=== Development ===\n\n\n==== Early inspirations ====\nSeries' creator Stephen Hillenburg first became fascinated with the ocean as a child and began developing his artistic abilities at a young age. Although these interests would not overlap for some time—the idea of drawing fish seemed boring to him—Hillenburg pursued both during college, majoring in marine biology and minoring in art. After graduating in 1984, he joined the Ocean Institute, an organization in Dana Point, California, dedicated to educating the public about marine science and maritime history.While Hillenburg was there, his love of the ocean began to influence his artistry. He created a precursor to SpongeBob SquarePants: a comic book titled The Intertidal Zone used by the institute to teach visiting students about the animal life of tide pools. The comic starred various anthropomorphic sea lifeforms, many of which would evolve into SpongeBob SquarePants characters. Hillenburg tried to get the comic professionally published, but none of the companies he sent it to were interested.A large inspiration to Hillenburg was Ween's 1997 album The Mollusk, which had a nautical and underwater theme. Hillenburg contacted the band shortly after the album's release, explaining the baseline ideas for SpongeBob SquarePants, and also requested a song from the band, which they sent on Christmas Eve. This song was \"Loop de Loop\", which was used in the episode \"Your Shoe's Untied\".\n\n\n==== Conception ====\nWhile working as a staff artist at the Ocean Institute, Hillenburg entertained plans to return eventually to college for a master's degree in art. Before this could materialize, he attended an animation festival, which inspired him to make a slight change in course. Instead of continuing his education with a traditional art program, Hillenburg chose to study experimental animation at the California Institute of the Arts. His thesis film, Wormholes, is about the theory of relativity. It was screened at festivals, and at one of these, Hillenburg met Joe Murray, creator of the popular Nickelodeon animated series, Rocko's Modern Life. Murray was impressed by the style of the film and offered Hillenburg a job. Hillenburg joined the series as a director, and later, during the fourth season, he took on the roles of producer and creative director.Martin Olson, one of the writers for Rocko's Modern Life, read The Intertidal Zone and encouraged Hillenburg to create a television series with a similar concept. At that point, Hillenburg had not even considered creating his own series. However, he realized that if he ever did, this would be the best approach. He began to develop some of the characters from The Intertidal Zone, including the comic's \"announcer\", Bob the Sponge. He wanted his series to stand out from most popular cartoons of the time, which he felt were exemplified by buddy comedies like The Ren & Stimpy Show. As a result, Hillenburg decided to focus on a single main character: the \"weirdest\" sea creature he could think of. This led him to the sponge. The Intertidal Zone's Bob the Sponge resembles an actual sea sponge, and at first, Hillenburg continued to use this design. In determining the new character's behavior, Hillenburg drew inspiration from innocent, childlike figures that he enjoyed, such as Charlie Chaplin, Laurel and Hardy, Jerry Lewis, and Pee-wee Herman. He then considered modeling the character after a kitchen sponge and realized this idea would match the character's square personality perfectly. Patrick, Mr. Krabs, Pearl, and Squidward were the next characters Hillenburg created for the show.To voice the series' central character, Hillenburg turned to Tom Kenny, whose career in animation had started alongside Hillenburg's on Rocko's Modern Life. Elements of Kenny's own personality were employed to develop the character further. Initially, Hillenburg wanted to use the name SpongeBoy—the character had no last name—and the series was to have been called SpongeBoy Ahoy! However, the Nickelodeon legal department discovered—after voice acting had been completed for the original seven-minute pilot episode—that the name \"SpongeBoy\" was already copyrighted. In choosing a replacement name, Hillenburg felt he still had to use the word \"Sponge\", so that viewers would not mistake the character for a \"Cheese Man\". He settled on the name \"SpongeBob\". \"SquarePants\" was chosen as a family name after Kenny saw a picture of the character and remarked, \"Boy, look at this sponge in square pants, thinking he can get a job in a fast food place.\" When he heard Kenny say it Hillenburg loved the phrase and felt it would reinforce the character's nerdiness.\n\n\n==== Assembling the crew ====\nDerek Drymon, who served as creative director for the first three seasons, has said that Hillenburg wanted to surround himself with a \"team of young and hungry people.\" Many of the major contributors to SpongeBob SquarePants had worked before with Hillenburg on Rocko's Modern Life, including: Drymon, art director Nick Jennings, supervising director Alan Smart, writer/voice actor Doug Lawrence (often credited as Mr. Lawrence), and Tim Hill, who helped develop the series bible.Although Drymon would go on to have a significant influence on SpongeBob SquarePants, he was not offered a role on the series initially. As a late recruit to Rocko's Modern Life, he had not established much of a relationship with Hillenburg before SpongeBob's conception. Hillenburg first sought out Drymon's storyboard partner, Mark O'Hare—but he had just created the soon-to-be syndicated comic strip, Citizen Dog. While he would later join SpongeBob as a writer, he lacked the time to get involved with both projects from the outset. Drymon has said, \"I remember Hillenburg's bringing it up to Mark in our office and asking him if he'd be interested in working on it ... I was all ready to say yes to the offer, but Steve didn't ask; he just left the room. I was pretty desperate ... so I ran into the hall after him and basically begged him for the job. He didn't jump at the chance.\" Once Hillenburg had given it some thought and decided to bring Drymon on as creative director, the two began meeting at Hillenburg's house several times a week to develop the series. Drymon has identified this period as having begun in 1996, shortly after the end of Rocko's Modern Life.Jennings was also instrumental in SpongeBob's genesis. Kenny has called him \"one of SpongeBob's early graphics mentors\". On weekends, Kenny joined Hillenburg, Jennings, and Drymon for creative sessions where they recorded ideas on a tape recorder. Kenny performed audio tests as SpongeBob during these sessions, while Hillenburg voice acted the other characters.Hill contributed scripts for several first-season episodes (including the pilot) and was offered the role of story editor, but turned it down—he would go on to pursue a career as a family film director. In his stead, Pete Burns was brought in for the job. Burns hailed from Chicago and had never met any of the principal players on SpongeBob before joining the team.\n\n\n==== Pitching ====\n\nWhile pitching the cartoon to Nickelodeon executives, Hillenburg donned a Hawaiian shirt, brought along an \"underwater terrarium with models of the characters\", and played Hawaiian music to set the theme. The setup was described by Nickelodeon executive Eric Coleman as \"pretty amazing\". They were given money and two weeks to write the pilot episode \"Help Wanted\". Drymon, Hillenburg, and Jennings returned with what was described by Nickelodeon official Albie Hecht as, \"a performance [he] wished [he] had on tape\". Although executive producer Derek Drymon described the pitch as stressful, he said it went \"very well\". Kevin Kay and Hecht had to step outside because they were \"exhausted from laughing\", which worried the cartoonists.In an interview, Cyma Zarghami, then-president of Nickelodeon, said, \"their [Nickelodeon executives'] immediate reaction was to see it again, both because they liked it and it was unlike anything they'd ever seen before\". Zarghami was one of four executives in the room when SpongeBob SquarePants was screened for the first time.Before commissioning the full series, Nickelodeon executives insisted that it would not be popular unless SpongeBob was a child who went to school, with his teacher as a main character. Hillenburg recalled in 2012 that Nickelodeon told him, \"Our winning formula is animation about kids in school... We want you to put SpongeBob in school.\" Hillenburg was ready to \"walk out\" on Nickelodeon and abandon the series, since he wanted SpongeBob to be an adult character. He eventually compromised by adding a new character to the main cast, Mrs. Puff, who is a boat-driving teacher. Hillenburg was happy with the compromise and said, \"A positive thing for me that came out of it was [how it brought] in a new character, Mrs. Puff, who I love.\"\n\n\n=== Executive producers and showrunners ===\nUntil his death in 2018, Hillenburg had served as the executive producer over the course of the series' entire history and functioned as its showrunner from its debut in 1999 until 2004. The series went on hiatus in 2002, after Hillenburg halted production on the show itself to work on the feature film The SpongeBob SquarePants Movie. Once the film was finalized and the third season finished, Hillenburg resigned as the series' showrunner. Although he no longer had a direct role in the series' production, he maintained an advisory role and reviewed each episode.\n\nWhen the film was completed, Hillenburg intended it to be the series finale, \"so [the show] wouldn't jump the shark.\" However, Nickelodeon wanted more episodes. Hillenburg appointed Paul Tibbitt, who had previously served on the show as a writer, director, and storyboard artist, to take over his role as showrunner to produce additional seasons. Hillenburg considered Tibbitt one of his favorite members of the show's crew, and \"totally trusted him\".On December 13, 2014, it was announced that Hillenburg would return to the series in an unspecified position. On November 26, 2018, at the age of 57, Hillenburg died from complications from amyotrophic lateral sclerosis (ALS), which he had been diagnosed with in March 2017. Nickelodeon confirmed via Twitter the series would continue after his death. In February 2019, incoming president Brian Robbins vowed Nickelodeon would keep the show in production for as long as the network exists.As of the ninth season, former writers and storyboard directors Vincent Waller and Marc Ceccarelli act as showrunners.\n\n\n=== Writing ===\nAccording to writer and storyboard artist Luke Brookshier, \"SpongeBob is written differently to many television shows.\" Unlike most of its contemporaries, SpongeBob SquarePants does not use written scripts. Instead, storylines are developed by a team of five outline and premise writers. A two-page outline is then assigned to a team of storyboard directors, who produce a complete rough draft of the storyboard. One of the methods used to assemble storyboards was to use Post-it notes. Most of the dialogue and jokes are added during this stage. Brookshier has likened this process to how cartoons were made \"in the early days of animation.\"The decision to eschew scripts for storyboards is one that Hillenburg made early in the series' development. Rocko's Modern Life had also used storyboarding derived from short outlines, and having worked on that series, Hillenburg felt strongly about adopting the process for SpongeBob SquarePants—even though Nickelodeon was beginning to show a greater preference for script-driven cartoons. Another series' writer, Merriwether Williams, explained in an interview that she and Mr. Lawrence would write a draft for an episode in an afternoon and be done at 4:00 pm.The writing staff often used their personal experiences as inspiration for the storylines of the series' episodes. For example, the episode \"Sailor Mouth\", where SpongeBob and Patrick learn profanity, was inspired by creative director Derek Drymon's experience as a child of getting into trouble for using the f-word in front of his mother. Drymon said, \"The scene where Patrick is running to Mr. Krabs to tattle, with SpongeBob chasing him, is pretty much how it happened in real life\". The end of the episode when Mr. Krabs uses even more profanity than SpongeBob and Patrick, was inspired \"by the fact that my [Drymon's] mother has a sailor mouth herself\". The idea for the episode \"The Secret Box\" also came from one of Drymon's childhood experiences. Hillenburg explained, \"Drymon had a secret box [as a kid] and started telling us about it. We wanted to make fun of him and use it.\"Almost every episode is divided into two 11-minute segments. Hillenburg explained: \"[I] never really wanted to deliberately try to write a half-hour show\". He added, \"I wrote the shows to where they felt right\".\n\n\n=== Voice actors ===\n\nCast members\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\nSpongeBob SquarePants features the voices of: Tom Kenny, Bill Fagerbakke, Rodger Bumpass, Clancy Brown, Mr. Lawrence, Jill Talley, Carolyn Lawrence, Mary Jo Catlett, and Lori Alan. Most one-off and background characters are voiced by Dee Bradley Baker, Sirena Irwin, Bob Joles, Mark Fite and Thomas F. Wilson.\n\nKenny voices SpongeBob and a number of other characters, including SpongeBob's pet snail Gary and the French narrator. He also physically portrays Patchy the Pirate in live-action segments of most special episodes. Kenny previously worked with Stephen Hillenburg on Rocko's Modern Life. When Hillenburg created SpongeBob SquarePants, he approached Kenny to voice the main character. Kenny originally used the voice of SpongeBob for a minor character on Rocko. He forgot how to perform the voice initially and did not intend to use it afterward. Hillenburg, however, used a video clip of the episode to remind Kenny of the voice. When Hillenburg heard Kenny perform the voice, he knew immediately he wanted it for his character. He said to Nickelodeon executives, \"That's it—I don't want to hear anybody else do the voice. We've got SpongeBob.\" The network insisted on auditioning more actors, but Hillenburg turned them down; in the words of Tom Kenny, \"one of the advantages of having a strong creator is that the creator can say, 'No, I like that—I don't care about celebrities.'\" While Kenny was developing SpongeBob's voice, the show's casting crew wanted him to have a unique, high-pitched laugh in the tradition of Popeye and Woody Woodpecker.Fagerbakke voices Patrick Star and other miscellaneous characters. At the same time when Hillenburg, Derek Drymon and Tim Hill were writing the pilot \"Help Wanted\", Hillenburg was also conducting auditions to find voices for the characters. Fagerbakke auditioned for the role of Patrick after Kenny had been cast. Fagerbakke recalled that during this audition, \"Hillenburg actually played for me a portion of Tom [Kenny]'s performance [as SpongeBob], and they were looking for a counterpoint.\" In an interview, Fagerbakke compared himself to the character and said, \"It's extremely gratifying\". Whenever Patrick is angry Fagerbakke models his performance after American actress Shelley Winters.Squidward Tentacles is voiced by Rodger Bumpass, who describes him as \"a very nasally, monotone kind of guy.\" He said the character \"became a very interesting character to do\" because of \"his sarcasm, and then his frustration, and then his apoplexy, and so he became a wide spectrum of emotions\". Arthur Brown, author of Everything I Need to Know, I Learned from Cartoons!, has compared Squidward's voice to that of Jack Benny's, a similarity Bumpass says is mostly unintentional. Voice acting veteran Clancy Brown voices Mr. Krabs, SpongeBob's boss at the Krusty Krab. Hillenburg modeled Mr. Krabs after his former manager at a seafood restaurant, whose strong Maine accent reminded Hillenburg of a pirate. Brown decided to use a \"piratey\" voice for the character with \"a little Scottish brogue\" after hearing Hillenburg's description of his boss. According to Brown, his Mr. Krabs voice was mostly improvised during his audition and it was not challenging for him to find the correct voice.Mr. Lawrence had met Hillenburg before on Rocko's Modern Life. While working on the pilot episode of SpongeBob, Hillenburg invited him to audition for all the characters. Since other voices had been found for the main cast already, Lawrence began by voicing a variety of minor characters. This included Plankton, who was initially only set to appear in one episode. Mr. Lawrence recalls that Nickelodeon executives told Hillenburg, \"'we could stunt-cast this. You know, we could have Bruce Willis do this voice.' And Steve was just like, 'it's Doug [Lawrence], don't you hear it? This is the character! This is the guy!'\" Jill Talley, Tom Kenny's wife, voices Karen Plankton. Being a Chicago native, she uses a Midwestern accent for the character. Electronic sound effects are underlaid by the series' audio engineers to create a robotic sound when she speaks. Talley and Mr. Lawrence often improvise Plankton and Karen's dialogue. Lawrence called improvisation his \"favorite part of the voice over\" in 2009. He elaborated in a 2012 interview, saying, \"I always enjoy the back-and-forth. [Talley and I] start to actually overlap so much talking to each other that [the voice directors] have to tell us, 'hey, stop doing that, separate what you're saying!'\"Carolyn Lawrence voices Sandy Cheeks. She was in Los Feliz, Los Angeles, with a friend who knew SpongeBob SquarePants casting director Donna Grillo. Her friend said to Grillo that Lawrence had \"an interesting voice\". Grillo invited her to audition and she got the role. American actress Mary Jo Catlett, who is known for her live-action roles on television programs from the 1970s such as Diff'rent Strokes and M*A*S*H provides Mrs. Puff's voice. As of 2017, voicing Mrs. Puff has become her only regular television role; Catlett described herself as \"basically retired\" in 2013, since she feels that voicing Mrs. Puff requires less preparation than her performances in person. Lori Alan voices Pearl Krabs. During her audition for the role, Alan was shown an early drawing of the characters and noted that Pearl was much larger than the rest of the cast. She decided to reflect the character's size in her voice by making it deep and full in tone. She aimed to make it invoke the sound of whales' low vocalizations while also sounding \"spoiled and lovable.\" In an interview with AfterBuzz TV, Alan said she knew Pearl \"had to sound somewhat like a child,\" but needed \"an abnormally large voice.\"In addition to the regular cast, episodes feature guest voices from many professions, including actors, athletes, authors, musicians, and artists. Recurring guest voices include: Ernest Borgnine, who voiced Mermaid Man from 1999 until his death in 2012; Tim Conway as the voice of Barnacle Boy from 1999 until his death in 2019; Brian Doyle-Murray as the Flying Dutchman; and Marion Ross as Grandma SquarePants. Notable guests who have provided vocal cameo appearances include: David Bowie as Lord Royal Highness in the television film Atlantis SquarePantis; John Goodman as the voice of Santa in the episode \"It's a SpongeBob Christmas!\"; Johnny Depp as the voice of the surf guru, Jack Kahuna Laguna, in the episode \"SpongeBob SquarePants vs. The Big One\"; and Victoria Beckham as the voice of Queen Amphitrite in the episode \"The Clash of Triton\".Voice recording sessions always include a full cast of actors, which Kenny describes as \"getting more unusual\". Kenny said, \"That's another thing that's given SpongeBob its special feel. Everybody's in the same room, doing it old radio-show style. It's how the stuff we like was recorded\". Series writer Jay Lender said, \"The recording sessions were always fun ...\" For the first three seasons, Hillenburg and Drymon sat in the recording studio and directed the actors. Andrea Romano became the voice director in the fourth season, and Tom Kenny took over the role during the ninth. Wednesday is recording day, the same schedule followed by the crew since 1999. Casting supervisor Jennie Monica Hammond said, \"I loved Wednesdays\".\n\n\n=== Animation ===\nApproximately 50 people work together to animate and produce an episode of SpongeBob SquarePants. Throughout its run, the series' production has been handled domestically at Nickelodeon Animation Studio in Burbank, California. The finished animation has been created overseas at Rough Draft Studios in South Korea. The California crew storyboard each episode. These are then used as templates by the crew in Korea, who animate each scene by hand, color each cel on computers, and paint backgrounds. Episodes are finished in California, where they are edited and have music added.During the first season, the series used cel animation. A shift was made the following year to digital ink and paint animation. In 2009, executive producer Paul Tibbitt said: \"The first season of SpongeBob was done the old-fashioned way on cells [sic], and every cell sic had to be part-painted, left to dry, paint some other colors. It's still a time-consuming aspect of the process now, but the digital way of doing things means it doesn't take long to correct\".In 2008, the crew began using Wacom Cintiqs for the drawings instead of pencils. The fifth season episode \"Pest of the West\", one of the half-hour specials, was the first episode where the crew applied this method. Series' background designer Kenny Pittenger said, \"The only real difference between the way we draw now and the way we drew then is that we abandoned pencil and paper during the fifth season\". The shift to Wacom Cintiqs let the designers and animators draw on computer screens and make immediate changes or undo mistakes. Pittenger said, \"Many neo-Luddites—er ... I mean, many of my cohorts—don't like working on them, but I find them useful. There's no substitute for the immediacy of drawing on a piece of paper, of course, but digital nautical nonsense is still pretty fun\".\nSince 2004, the SpongeBob crew has periodically collaborated with the LA-based animation studio Screen Novelties to create stop-motion sequences for special episodes. The studio produced a brief claymation scene for the climax of the first theatrical film. It was re-enlisted in 2009 to create an exclusive opening for the series' tenth anniversary special. The abominable snow mollusk, an octopus-like creature made of clay who acts as the antagonist of the double-length episode \"Frozen Face-Off\", was also animated by the company. Animation World Network reported that \"within the SpongeBob creative team, there was always talk of doing a more involved project together\" with Screen Novelties. As a result, the group was asked to create an episode animated entirely in stop motion in 2011. This project became \"It's a SpongeBob Christmas!\", which reimagined the show's characters as if they were part of a Rankin/Bass holiday film. Tom Kenny, who is normally uninvolved in the writing process, contributed to the episode's plot; he said in 2012 that he and Nickelodeon \"wanted to do something just like those old school, stop-motion Rankin-Bass holiday specials ... which I watched over and over again when I was a kid growing up in Syracuse.\" Unconventional materials such as baking soda, glitter, wood chips and breakfast cereal were used in mass quantities to create the special's sets. Members of the Screen Novelties crew received one win and two nominations at the 30th Annie Awards, a nomination at the 2013 Golden Reel Awards, and a nomination at the 2013 Annecy International Animated Film Festival for animating the episode. The team built a dolphin puppet named Bubbles, voiced by Matt Berry, for The SpongeBob Movie: Sponge Out of Water. Sequences involving Bubbles included a blend of stop motion and traditional animation. A second special animated in stop motion, themed around Halloween and using the same Rankin/Bass-inspired character models, was produced for season 11.\n\n\n=== Music ===\n\nMark Harrison and Blaise Smith composed the SpongeBob SquarePants theme song. Its lyrics were written by Stephen Hillenburg and the series' original creative director Derek Drymon. The melody was inspired by the sea shanty \"Blow the Man Down\". An old oil painting of a pirate is used in the opening sequence. Dubbed \"Painty the Pirate\", according to Tom Kenny, Hillenburg found it in a thrift shop \"years ago\". Patrick Pinney voices Painty the Pirate, singing the theme song as the character. Hillenburg's lips were imposed onto the painting and move along with the lyrics. Kenny joked this is \"about as close of a glimpse as most SpongeBob fans are ever going to get of Steve Hillenburg\", because of his private nature.A cover of the song by Avril Lavigne can be found on the SpongeBob SquarePants Movie soundtrack. Another cover by the Violent Femmes aired on Nickelodeon as a promotion when the series moved to prime time.Steve Belfer, one of Hillenburg's friends from CalArts, wrote and performed the music heard over the end credits. This theme includes ukulele music at Hillenburg's request. Drymon said, \"It's so long ago, it's hard to be sure, but I remember Hillenburg having the Belfer music early on, maybe before the pilot\".The series' music editor and main composer is Nicolas Carr. After working with Hillenburg on Rocko's Modern Life, he struggled to find a new job in his field. He had considered a career change before Hillenburg offered him the job. The first season's score primarily featured selections from the Associated Production Music Library, which Carr has said includes \"lots of great old corny Hawaiian music and big, full, dramatic orchestral scores.\" Rocko's Modern Life also used music from this library. It was Hillenburg's decision to adopt this approach. Carr has described the selections for SpongeBob SquarePants as being \"more over-the-top\" than those for Rocko's Modern Life.Hillenburg felt it was important for the series to develop its own music library, consisting of scores that could be reused and re-edited throughout the years. He wanted these scores to be composed by unknowns, and a group of twelve was assembled. They formed \"The Sponge Divers Orchestra\", which includes Carr and Belfer. The group went on to provide most of the music for later seasons, although Carr still draws from the Associated Production Music Library, as well as another library that he founded himself—Animation Music Inc.\n\n\n== Broadcast ==\n\n\n=== Episodes ===\n\n\n=== Tenth anniversary ===\n\nNickelodeon began celebrating the series' 10th anniversary on January 18, 2009, with a live cast reading of the episode \"SpongeBob vs. The Big One\". The reading—a first for the series—was held at that year's Sundance Film Festival. The episode, which premiered on TV on April 17, 2009, features Johnny Depp as a guest star. Other celebratory actions taken by the network included the launching of a new website for the series (spongebob.com) and the introduction of new merchandise. A \"SpongeBob and water conservation-themed element\" was also added to Nickelodeon's pro-social campaign The Big Green Help. In an interview, Tom Kenny said, \"What I'm most proud of is that kids still really like [SpongeBob SquarePants] and care about it ... They eagerly await new episodes. People who were young children when it started 10 years ago are still watching it and digging it and think it's funny. That's the loving cup for me.\"Three nights before the official anniversary date, an hour-long documentary on the series, Square Roots: The Story of SpongeBob SquarePants, premiered on VH1. Critically acclaimed duo Patrick Creadon and Christine O'Malley created the film as a followup to I.O.U.S.A.—a documentary on America's financial situation. Creadon remarked, \"After spending two years examining the financial health of the United States, Christine and I were ready to tackle something a little more upbeat. Telling the SpongeBob story feels like the perfect fit.\" On Friday, July 17, Nickelodeon marked the official anniversary of the series, with a 50-hour television marathon titled \"The Ultimate SpongeBob SpongeBash Weekend\". It began with a new episode, \"To SquarePants or Not to SquarePants\". Saturday saw a countdown of the top ten episodes as picked by fans, as well as an airing of The SpongeBob SquarePants Movie. The marathon finished on Sunday, with a countdown of episodes picked by celebrities and the premiere of ten new episodes.Nickelodeon continued celebrating the anniversary through the rest of the year. An eight-episode DVD set featuring To SquarePants or Not to SquarePants was released shortly after the marathon on July 21. Next a 2,200 minute, 14-disc DVD set titled The First 100 Episodes was released on September 22. Finally, on November 6, an hour-long television film, titled Truth or Square, debuted on Nickelodeon. The film is narrated by Ricky Gervais and features live action cameo appearances by: Rosario Dawson, Craig Ferguson, Will Ferrell, Tina Fey, LeBron James, P!nk, Triumph the Insult Comic Dog, and Robin Williams. It was released as part of a five-episode DVD set on November 10, 2009.\n\n\n=== Twentieth anniversary ===\nOn February 11, 2019, Nickelodeon announced it would recognize the twentieth anniversary of SpongeBob SquarePants with a series of celebrations known as the \"Best Year Ever\". In honor of the anniversary, Pantone created color shades known as \"SpongeBob SquarePants Yellow\" and \"Patrick Star Pink\" to be used by Nickelodeon's licensing partners. Romero Britto, Jon Burgerman, and the Filipino art collective Secret Fresh were commissioned by Nickelodeon to create art pieces devoted to SpongeBob SquarePants. Some of these pieces were to be adapted into commercial products. On February 12, in conjunction with Nickelodeon's announcement of the \"Best Year Ever\", Cynthia Rowley presented a SpongeBob SquarePants-themed wetsuit during New York Fashion Week. A month later, Marlou Breuls presented the SpongeBob SquarePants-themed \"Icon Collection\" during Amsterdam Fashion Week. That summer, Nike, in collaboration with Kyrie Irving, released a SpongeBob SquarePants series of shoes, accessories, and apparel. In July, for the first time ever, SpongeBob SquarePants became the theme of a cosmetics line, which was released as a limited time offering by HipDot Studios. The \"Best Year Ever\" also introduced an official SpongeBob SquarePants YouTube channel and a new mobile game based on the series, along with new toy lines.The \"Best Year Ever\" formally began on July 12, 2019, with the premiere of the one-hour, live-action/animated TV special SpongeBob's Big Birthday Blowout. It continued that month at San Diego Comic Con, with two panels, a booth, and various activities devoted to the series. The \"Best Year Ever\" was recognized on Amazon Prime Day with an exclusive early release of SpongeBob SquarePants: The Best 200 Episodes Ever!, a 30-disc DVD compilation of two box sets, SpongeBob SquarePants: The First 100 Episodes and SpongeBob SquarePants: The Next 100 Episodes. The collections received a standard nationwide release on August 27. The \"Best Year Ever\" continued into 2020 culminating with the August 14 release of The SpongeBob Movie: Sponge on the Run.\n\n\n== Reception ==\n\n\n=== Ratings and run-length achievements ===\nWithin its first month on air, SpongeBob SquarePants overtook Pokémon as the highest rated Saturday-morning children's series on television. It held an average national Nielsen rating of 4.9 among children aged two through eleven, denoting 1.9 million viewers. Two years later, the series had firmly established itself as Nickelodeon's second highest-rated children's program, after Rugrats. SpongeBob SquarePants was credited with helping Nickelodeon take the \"Saturday-morning ratings crown\" for the fourth straight season in 2001. The series had gained a significant adult audience by that point—nearly 40 percent of its 2.2 million viewers were aged 18 to 34. In response to its weekend success, Nickelodeon gave SpongeBob SquarePants time slots at 6:00 pm and 8:00 pm, Monday through Thursday, to increase the series' exposure. By the end of 2001, SpongeBob SquarePants boasted the highest ratings for any children's series, on all of television. Weekly viewership of the series had reached around fifteen million, at least five million of whom were adults.In October 2002, another Nickelodeon series, The Fairly OddParents, ranked as the number two program for children between two and eleven years old. Its ratings at that time were almost equal to SpongeBob SquarePants' then-average of 2.2 million viewers per episode. The Fairly OddParents even briefly surpassed SpongeBob SquarePants, causing it to drop into second place. At this time, The Fairly OddParents had a 6.2 rating and nearly 2.5 million child viewers, while SpongeBob SquarePants had a 6.0 rating and 2.4 million child viewers aged two to eleven. Nickelodeon \"recognized\" The Fairly OddParents for its climbing ratings and installed it in a new 8:00 PM time slot, previously occupied by SpongeBob SquarePants. In an interview, Cyma Zarghami, then-general manager and executive vice president of Nickelodeon, said, \"Are we banking on the fact that Fairly OddParents will be the next SpongeBob? ... We are hoping. But SpongeBob is so unique, it's hard to say if it will ever be repeated.\"In 2012, however, the series' ratings were declining. The average number of viewers aged two to eleven watching SpongeBob at any given time dropped 29% in the first quarter from a year earlier, according to Nielsen. Wall Street Journal business writer John Jannarone suggested the series' age and oversaturation might be contributing to its ratings' decline and might also be directly responsible for the decline in Nickelodeon's overall ratings. Media analyst Todd Juenger attributed the decline in Nickelodeon's ratings directly to the availability of streaming video content on services like Netflix, a provider of on-demand Internet streaming media.Philippe Dauman, the president and CEO of Viacom, contradicted that notion, saying: \"We are getting nice revenues through these subscription VOD deals\", adding Netflix only has \"some library content\" on its service. A Nickelodeon spokesman said, \"SpongeBob is performing consistently well and remains the number one rated animated series in all of children's television.\" He added, \"There is nothing that we have seen that points to SpongeBob as a problem.\" Dauman blamed the drop on \"some ratings systemic issues\" at Nielsen, citing extensive set-top-box data that \"does in no way reflect\" the Nielsen data.Juenger noted SpongeBob could affect the ratings of other Nickelodeon programming because children often change channels to find their favorite programs, then stay tuned to that network. Nickelodeon reduced its exposure on television. In the first quarter of 2012, the network cut back on the number of episodes it aired by 16% compared to a year earlier.On April 22, 2013, Netflix CEO Reed Hastings announced their intentions not to renew their existing deal with Viacom. Viacom's deal with Netflix expired, and shows such as SpongeBob and Dora the Explorer were removed. However, seasons five through eight of SpongeBob are still available to stream on Netflix in Canada. On June 4, 2013, Viacom announced a multi-year licensing agreement which would move its programs, such as SpongeBob and Dora the Explorer, to Amazon.com, Netflix's top competitor. Amazon agreed to pay more than $200 million to Viacom for the license, its largest subscription streaming transaction ever.SpongeBob SquarePants is one of the longest-running series on Nickelodeon. It became the network's series with the most episodes during its eighth season, surpassing the 172 episodes of Rugrats. In the ninth season, its 26 episodes brought the number of episodes produced to 204. In a statement, Brown Johnson, Nickelodeon's animation president said, \"SpongeBob's success in reaching over 200 episodes is a testament to creator Stephen Hillenburg's vision, comedic sensibility and his dynamic, lovable characters. The series now joins the club of contemporary classic Nicktoons that have hit this benchmark, so we're incredibly proud.\" Many children of the 2000s grew up with the series, leading to the series possessing an extensive influence on Generation Z and millennials and greater internet culture.\n\n\n=== Critical reception ===\nSpongeBob SquarePants has been widely praised particularly for its appeal to different age groups, and the show has earned numerous awards and accolades throughout its run. James Poniewozik of Time magazine described the title character as \"the anti-Bart Simpson, temperamentally and physically: his head is as squared-off and neat as Bart's is unruly, and he has a personality to match—conscientious, optimistic and blind to the faults in the world and those around him.\" According to Laura Fries of Variety magazine, the series is \"a thoughtful and inventive cartoon about a hopelessly optimistic and resilient sea sponge ... Devoid of the double entendres rife in today's animated TV shows, this is purely kid's stuff. ... However, that's not to say that SpongeBob is simplistic or even juvenile. It's charming and whimsical, but clever enough to appeal to teens and college-aged kids, as well.\" The New York Times' critic Joyce Millman said SpongeBob \"is clever without being impenetrable to young viewers and goofy without boring grown-ups to tears. It's the most charming toon on television, and one of the weirdest. And it's also good, clean fun, which makes sense because it is, after all, about a sponge.\" Millman wrote, \"His relentless good cheer would be irritating if he weren't so darned lovable and his world so excellently strange. ... Like Pee-wee's Playhouse, SpongeBob joyfully dances on the fine line between childhood and adulthood, guilelessness and camp, the warped and the sweet.\"\nRobert Thompson, a professor of communications and director of the Center for the Study of Popular Television at Syracuse University, told The New York TimesThere is something kind of unique about [SpongeBob]. It seems to be a refreshing breath from the pre-irony era. There's no sense of the elbow-in-rib, tongue-in-cheek aesthetic that so permeates the rest of American culture—including kids' shows like the Rugrats. I think what's subversive about it is it's so incredibly naive—deliberately. Because there's nothing in it that's trying to be hip or cool or anything else, hipness can be grafted onto it. In another interview with Los Angeles Times, he commentated on the show's adult audience: \"[On one hand] It's a kind of time machine that transports parents back to when they watched TV in their footie [pajamas]. On the other hand, it's very hip in the way it's presented. It is very edgy to adults who know how to read and listen between the frames.\" Television critics Alan Sepinwall and Matt Zoller Seitz ranked SpongeBob SquarePants as the 22nd greatest American TV series of all time in their 2016 book TV (The Book). In a 2007 interview, Barack Obama said SpongeBob is his favorite TV character and admitted that SpongeBob SquarePants is \"the show I watch with my daughters.\"\n\n\n=== Awards and accolades ===\n\nSpongeBob SquarePants has received many awards and nominations; among these are four Emmy Awards (Outstanding Special Class Animated Program in 2010; Outstanding Sound Editing – Animation\" in 2014; Outstanding Children's Animated Series in 2018; and Outstanding Performer in an Animated Program in 2018 for Kenny); six Annie Awards; and two BAFTA Children's Awards. In 2006, IGN ranked SpongeBob SquarePants 15th on its list, Top 25 Animated Series of All Time, and in 2013, it ranked the series 12th on its list, The Top 25 Animated Series for Adults. In addition, the website's UK division ran a Top 100 Animated Series list, and like its US counterpart, ranked SpongeBob SquarePants 15th.TV Guide listed SpongeBob SquarePants himself at number nine on its list 50 Greatest Cartoon Characters of All Time in 2002. In June 2010, Entertainment Weekly named SpongeBob one of the 100 Greatest Characters of the Last 20 Years. Viewers of UK television network Channel 4 voted SpongeBob SquarePants the 28th Greatest Cartoon in a 2004 poll. The series is among the All-TIME 100 TV Shows as chosen by Time television critic James Poniewozik in 2007. He said, \"It's the most funny, surreal, inventive example of the explosion in creative kids' (and adult) entertainment that Nick, Cartoon Network and their ilk made possible.\" In 2013, the publication ranked SpongeBob SquarePants the eighth Greatest TV Cartoon of All Time. Television critic Matt Zoller Seitz included the series in his 2016 book with Alan Sepinwall titled TV (The Book) as the 22nd greatest American television series of all time, saying that \"SpongeBob SquarePants is an absurdist masterpiece that Salvador Dalí and Groucho Marx would have watched together in their smoking jackets\".\n\n\n== Legacy ==\nIn July 2009, Madame Tussauds wax museum in New York launched a wax sculpture of SpongeBob in celebration of the series' 10th anniversary. SpongeBob became the first animated character sculpted entirely out of wax.The character has also become a trend in Egypt at Cairo's Tahrir Square. After the Egyptian Revolution of 2011, SpongeBob became a fashion phenomenon, appearing on various merchandise items from hijabs to boxer shorts. The phenomenon led to the creation of the Tumblr project called \"SpongeBob on the Nile\". The project was founded by American students Andrew Leber and Elisabeth Jaquette and attempts to document every appearance of SpongeBob in Egypt. Sherief Elkeshta cited the phenomenon in an essay about the incoherent state of politics in Egypt in an independent monthly paper titled Midan Masr. He wrote, \"Why isn't he [SpongeBob] at least holding a Molotov cocktail? Or raising a fist?\" The phenomenon has even spread to Libya, where a Libyan rebel in SpongeBob dress was photographed celebrating the revolution. Although The Guardian and Vice have asserted that the trend has little to no political significance, \"joke\" presidential campaigns have been undertaken for SpongeBob in Egypt and Syria.A clip was posted to YouTube in February 2013 that features soldiers in the Russian army and navy singing the SpongeBob SquarePants theme song as they march. According to the website that uploaded the video, this is one of the \"most popular marching songs\" in the Russian military. The video garnered nearly 50,000 views within its first week.Following Hillenburg's death in November 2018, more than 1.2 million fans signed a petition for the National Football League to have the song \"Sweet Victory\" from the season 2 episode \"Band Geeks\" performed in his honor at the Super Bowl LIII halftime show. Atlanta's Mercedes-Benz Stadium's Twitter account, the venue of the show, tweeted a GIF of SpongeBob dancing in \"Band Geeks\" in December. Maroon 5 who were performing at the game, included a brief clip of SpongeBob in a preview video, leading fans to believe the song would be performed. While the song's opening was ultimately included, it served as a transition into artist Travis Scott's set, which left many fans disappointed. In response to fans' disappointment at not hearing the complete \"Sweet Victory\" song during the halftime show at the Super Bowl LIII, the Dallas Stars of the National Hockey League showed a clip of the full \"Sweet Victory\" song during a game at the American Airlines Center. In the clip, the characters' band uniforms are recolored green after the Stars.Several species of organism have been named in reference to SpongeBob. In May 2011, a new species of mushroom, Spongiforma squarepantsii, was described and named after the series' title character. In 2019, a species of sea sponge, Clathria hillenburgi, was named in honor of Hillenburg, also referencing his creation of SpongeBob SquarePants. In 2020, a species of abyssal sea star, Astrolirus patricki, was described and named after Patrick Star; individuals of this species were found to be closely associated with hexactinellid sponges, and it was thus named after Patrick as a reference to the character's friendship with SpongeBob.In honor of Stephen Hillenburg, a non-profit fan project, titled The SpongeBob SquarePants Movie Rehydrated, was released online on May 1, 2022. It consists of a recreation of The SpongeBob SquarePants Movie reanimated by 300 people with re-recorded music and dialogue. Amid the YouTube premiere, the video was taken down by Paramount Global due to copyright laws. As a result, the hashtag #JusticeForSpongeBob became trending on Twitter against Paramount's action. The video was restored the following day.\n\n\n== Criticism ==\n\n\n=== Controversies ===\n\n\n==== Sexuality ====\nIn 2005, an online video that showed clips from SpongeBob SquarePants and other children's shows set to the Sister Sledge song \"We Are Family\" to promote diversity and tolerance was attacked by an evangelical group in the United States. They saw SpongeBob being used to \"advocate homosexuality\". James Dobson of Focus on the Family accused the video of promoting homosexuality because it was sponsored by a pro-tolerance group. The incident prompted the question whether SpongeBob is gay. Although the character has enjoyed popularity with gay viewers, series creator Stephen Hillenburg had already denied SpongeBob is gay three years earlier, clarifying at the time he considered the character to be \"somewhat asexual\". After Dobson's comments, Hillenburg reasserted his position, stating that sexual preference does not play a part in what they are \"trying to do\" with the series. Tom Kenny and other production members were distraught that the issue had arisen. Dobson later said his comments were taken out of context and his original complaints were not with SpongeBob, the video, or any of the characters in the video, but rather with the organization that sponsored the video, the We Are Family Foundation. Dobson said they posted pro-gay material on their website, but later removed it. After the controversy, John H. Thomas, the United Church of Christ's general minister and president, said they would welcome SpongeBob into their ministry. He said: \"Jesus didn't turn people away. Neither do we.\"Queer theorist Jeffery P. Dennis, author of the journal article \"Queertoons\", argued that SpongeBob and Sandy are not romantically in love, but added he believed SpongeBob and Patrick \"are paired with arguably erotic intensity\". Martin Goodman of Animation World Magazine called Dennis' comments regarding SpongeBob and Patrick \"interesting\". Ukrainian website Family Under the Protection of the Holy Virgin, which has been described as a \"fringe Catholic\" group by The Wall Street Journal, criticized SpongeBob SquarePants for its alleged \"promotion of homosexuality\". The group sought to have the series banned, along with several other popular children's properties. The National Expert Commission of Ukraine on the Protection of Public Morality took up the matter for review in August 2012. Questions of SpongeBob's sexuality resurfaced in 2020 after Nickelodeon's official Twitter account posted an image of the character, in rainbow colors with text celebrating the LGBTQ+ community and its allies during Pride Month. Although the post did not make any assertions about SpongeBob's sexual orientation, numerous users responded on social media, claiming they already had their suspicions that he might be gay or reasserting Hillenburg's description of asexuality.In April 2009, Burger King released a SpongeBob-themed advertisement featuring a parody of Sir Mix-a-Lot's song \"Baby Got Back\". The Campaign for a Commercial-Free Childhood protested the ad for being sexist and inappropriately sexual, especially considering SpongeBob's fan base includes young children. In official statements released by Burger King and Nickelodeon, both companies claimed the campaign was aimed at parents.\n\n\n==== Other ====\n\nA 2011 study conducted at the University of Virginia, published in the journal Pediatrics, suggested that allowing preschool-aged audiences to watch the series caused short-term disruptions in mental function and attention span because of frequent shot changes, compared to control groups watching Caillou and drawing pictures. A Nickelodeon executive responded in an interview the series was not intended for an audience of that age and that the study used \"questionable methodology and could not possibly provide the basis for any valid findings that parents could trust.\"Several of the series' episodes have also been the subject of controversy. In a report titled \"Wolves in Sheep's Clothing\", which documents the increase in potentially violent, profane, and sexual content in children's programming, the Parents Television Council, a watchdog media group, claimed the season 2 SpongeBob SquarePants episode \"Sailor Mouth\" was an implicit attempt to promote and satirize use of profanity among children. \"SpongeBob's Last Stand\" (season 7) and \"Selling Out\" (season 4) have been criticized for promoting environmentalism and left-wing politics because of their negative portrayal of big business. \"SpongeBob, You're Fired\" (season 9) caused widespread controversy and sparked a political debate over its portrayal of unemployment; after Fox News and the New York Post commented on the episode, Media Matters for America accused the two organizations of using the episode to \"attack the social safety net.\" This statement was echoed by Al Sharpton, who claimed conservatives' \"new hero\" to be \"a sponge who lives in a pineapple under the sea.\" In 2014, Zabira Orazalieva, chairwoman of the Committee for the Protection of Children's Rights in Kazakhstan, deemed the show too violent for children, labeling the titular character a \"self-absorbed hooligan\" who \"regularly inflicts violence on others in his community and seems to enjoy what he does.\"In 2019, University of Washington professor Holly M. Barker stated that the show promotes \"violent and racist\" colonialism, since Bikini Bottom is named after Bikini Atoll, a place where natives were resettled by the US government for nuclear testing. Barker also pointed out the alleged cultural appropriation of Pacific culture in the show. Because of such content, children have \"become acculturated to an ideology that includes the U.S. character SpongeBob residing on another people's homeland\", according to Barker. ViacomCBS eventually pulled the episode \"Mid-Life Crustacean\" (season 3), first aired in 2003, out of circulation in March 2021, presumably due to its ending in which SpongeBob, Patrick, and Mr. Krabs partake in a panty raid. \"We determined some story elements were not kid-appropriate\", a Nickelodeon representative stated. The release of a later episode, \"Kwarantined Krab\" (season 12), would be delayed by two years over its similarities to the COVID-19 pandemic.\n\n\n=== Allegations of declining quality ===\nVarious media outlets including MSN, The A.V. Club, and Vulture have reported that SpongeBob's popularity declined following the release of the 2004 film and Hillenburg's departure as showrunner. In 2012, MSN cited a post on Encyclopedia SpongeBobia, a Fandom-hosted wiki, which said that many fans felt the series had \"jumped the shark\" following the release of The SpongeBob SquarePants Movie and that online fansites were becoming \"deserted.\"As of 2011, episodes produced since the first film have been variously categorized by DVD Talk and DVD Verdict as \"tedious;\" \"boring\" and \"dreck;\" a \"depressing plateau of mediocrity;\" and \"laugh-skimpy.\" In 2018, Vulture noted the most popular online memes of the series usually focused on episodes from the first three seasons. That same year, The A.V. Club wrote that as the series went on, \"[it] leaned hard into kid-friendly physical humor and gross out moments that appealed to no one in particular\".Nickelodeon faced criticism from fans and former staff like Paul Tibbitt when the network greenlit spinoffs (see below) after the death of Hillenburg, who had previously expressed hesitation in deriving from the parent series. \"The show is about SpongeBob, he's the core element, and it's about how he relates to the other characters,\" Hillenburg told Television Business International. \"Patrick by himself might be a bit too much. So I don't see any spin-offs.\"\n\n\n== Other media ==\n\n\n=== Spin-offs ===\n\n\n==== Kamp Koral: SpongeBob's Under Years ====\n\nOn February 14, 2019, it was announced that a SpongeBob SquarePants spin-off is in development. On June 4, it was announced the spinoff will be titled Kamp Koral. The plot will focus on a 10-year-old SpongeBob and his friends at the titular camp located in the Kelp Forest, where they spend the summer catching jellyfish, building campfires, and swimming in Lake Yuckymuck. It serves as a tie-in to the animated film The SpongeBob Movie: Sponge on the Run. It was confirmed production of the series began in June 2019.Nickelodeon animation head Ramsey Naito said of the series, \"SpongeBob has an incredible universe to expand upon and the greenlight for Kamp Koral is a testament to the strength and longevity of these characters known and loved by generations of fans around the world.\" Like SpongeBob SquarePants, the series is co-executive produced by Marc Ceccarelli, Jennie Monica, and Vincent Waller. Kamp Koral is produced using computer animation rather than the digital ink and paint animation used for SpongeBob SquarePants.On February 19, 2020, it was announced that the series had an official title of Kamp Koral: SpongeBob's Under Years, and would be premiering in July 2020. On July 30, 2020, it was announced that the series would be released on CBS All Access (now Paramount+), the ViacomCBS streaming service, in early 2021. On January 28, 2021, it was announced that the series would premiere on March 4, 2021.\n\n\n==== The Patrick Star Show ====\n\nOn August 10, 2020, it was reported that a Patrick Star talk show titled The Patrick Star Show was in development with a 13-episode order. Additionally, it was reported that the show would be similar to other talk shows such as The Larry Sanders Show and Comedy Bang! Bang! The series premiered on Nickelodeon on July 9, 2021, with the series set to be available on Paramount+ later on.\n\n\n=== Streaming ===\nOriginally, SpongeBob SquarePants was streaming on Netflix. However, the series was removed from the United States in 2013 due to their deal with Viacom not being renewed. The series was also available to stream on Hulu starting in 2012 until being removed in 2016. The series later streamed on Amazon Prime Video in 2013 after the Netflix deal ended. As part of the rebranding plan of Paramount+, the series joined along with other ViacomCBS shows on July 30, 2020.Currently, the first 6 seasons are available to be streamed on Prime Video and the first 12 seasons through Paramount+. The series is available to stream on Netflix in Canada.\n\n\n=== Home video ===\n\nSpongeBob SquarePants DVD releases are distributed by Paramount Home Entertainment under the Nickelodeon label.\n\n\n=== Comic books ===\n\nThe 32-page bimonthly comic book series, SpongeBob Comics, was announced in November 2010 and debuted the following February. Before this, SpongeBob SquarePants comics had been published in Nickelodeon Magazine, and episodes of the television series had been adapted by Cine-Manga, but SpongeBob Comics was the first American comic book series devoted solely to SpongeBob SquarePants. It also served as SpongeBob SquarePants creator Stephen Hillenburg's debut as a comic book author. The series was published by Hillenburg's production company, United Plankton Pictures, and distributed by Bongo Comics Group. Hillenburg described the stories from the comic books as \"original and always true to the humor, characters, and universe of the SpongeBob SquarePants series.\" Leading up to the release of the series, Hillenburg said, \"I'm hoping that fans will enjoy finally having a SpongeBob comic book from me.\"Chris Duffy, the former senior editor of Nickelodeon Magazine, serves as managing editor of SpongeBob Comics. Hillenburg and Duffy met with various cartoonists—including James Kochalka, Hilary Barta, Graham Annable, Gregg Schigiel, and Jacob Chabot—to contribute to each issues. Retired horror comics writer and artist Stephen R. Bissette returned to write a special Halloween issue in 2012, with Tony Millionaire and Al Jaffee. In an interview with Tom Spurgeon, Bissette said, \"I've even broken my retirement to do one work-for-hire gig [for SpongeBob Comics] so I could share everything about that kind of current job.\"In the United Kingdom, Titan Magazines published comics based on SpongeBob SquarePants every four weeks from February 3, 2005, through November 28, 2013. Titan Magazines also teamed up with Lego to release a limited edition SpongeBob-themed comic.\n\n\n=== Films ===\n\nParamount Pictures and Nickelodeon Movies produced The SpongeBob SquarePants Movie, an animated film adaptation of the series released on November 19, 2004. The film was directed by Hillenburg, and written by long-time series writers Derek Drymon, Tim Hill, Kent Osborne, Aaron Springer, Paul Tibbitt, and Hillenburg. He and Julia Pistor produced the film, while Gregor Narholz composed the film's score. The film is about Plankton's evil plan to steal King Neptune's crown and send it to Shell City. SpongeBob and Patrick must retrieve it and save Mr. Krabs' life from Neptune's raft and their home, Bikini Bottom, from Plankton's plan. It features guest appearances by Jeffrey Tambor as King Neptune, Scarlett Johansson as the King's daughter Mindy, Alec Baldwin as Dennis, and David Hasselhoff as himself, and received a positive critical reception, It grossed over $140 million worldwide. Three television films were released: SpongeBob's Atlantis SquarePantis in 2007, SpongeBob's Truth or Square in 2009, and SpongeBob's Big Birthday Blowout in 2019.\nA sequel to the 2004 film, The SpongeBob Movie: Sponge Out of Water, was released in theaters on February 6, 2015. The series' main cast members reprised their roles. The underwater parts are animated traditionally in the manner of the series—the live-action parts use CGI animation with the SpongeBob characters. The film has a budget similar to the previous film and cost less than $100 million to produce.On April 30, 2015, Viacom announced a third film was in development. In April 2018, Tim Hill was named as director, and the film's original title, It's a Wonderful Sponge, was revealed. Paramount originally scheduled a release date of July 17, 2020, later moving it earlier to May 22, 2020. In October 2018, it was announced the movie will be an origin story of how SpongeBob came to Bikini Bottom and how he got his square pants. Around the same time, it was announced that Hans Zimmer will compose the music. The first poster along with a title change to Sponge on the Run was revealed on November 12, 2019, with the first trailer releasing on November 14. The film was later delayed to July 31, 2020 (and later August 7, 2020) due to the COVID-19 pandemic. The film's worldwide theatrical release was later cancelled in June 2020 and it was announced that it would be released in Canadian theaters on August 14, 2020, followed by a release on premium video on demand before heading to Paramount+ in early 2021. On January 28, 2021, it was announced that the film would be released on the service on March 4, 2021.\n\n\n==== In development ====\n\n\n===== The SpongeBob Movie: Search for SquarePants (2025) =====\nOn August 24, 2021, Brian Robbins, CEO of Nickelodeon, stated that a new theatrical SpongeBob film is \"in the works.\" The fourth main SpongeBob film, The SpongeBob Movie: Search for SquarePants, was set for release on May 23, 2025, but was later delayed to December 19 of that year, with the untitled eighth Mission: Impossible film taking its previous date due to the 2023 SAG-AFTRA strike.\n\n\n===== Spinoff films =====\nIn November 2019, The New York Times reported that a \"music-based\" Squidward project was in development for Netflix. In early March 2020, ViacomCBS announced that it would be producing two spin-off films based on the series for Paramount+. In February 2022, it was revealed that these plans had been revised to three character spinoff films.\n\n\n====== Saving Bikini Bottom: The Sandy Cheeks Movie (2024) ======\nThe first character spinoff film, Saving Bikini Bottom: The Sandy Cheeks Movie, is set to be released in 2024. Prior to its release, the entire film was leaked on January 21, 2024, as a video upload on X (the website formerly known as Twitter).\n\n\n=== Music ===\nCollections of original music featured in the series have been released on the albums SpongeBob SquarePants: Original Theme Highlights (2001), SpongeBob's Greatest Hits (2009), and The Yellow Album (2005). The first two charted on the US Billboard 200, reaching number 171 and 122, respectively.Several songs have been recorded for the purpose of a single or album release, and have not been featured on the show. The song \"My Tighty Whiteys\" written by Tom Kenny and Andy Paley was released only on the album The Best Day Ever (2006). Kenny's inspiration for the song was \"underwear humor,\" saying: \"Underwear humor is always a surefire laugh-getter with kids ... Just seeing a character that odd wearing really prosaic, normal, Kmart, three-to-a-pack underwear is a funny drawing ... We thought it was funny to make a really lush, beautiful love song to his underwear.\"A soundtrack album The SpongeBob SquarePants Movie – Music from the Movie and More..., featuring the film's score was released along with the feature-length film in November 2004. Various artists including the Flaming Lips, Wilco, Ween, Motörhead, the Shins, and Avril Lavigne contributed to the soundtrack that reached number 76 on the US Billboard 200.\n\n\n=== Theme park rides ===\nThe SpongeBob SquarePants 4-D film and ride opened at several locations including Six Flags Over Texas, Flamingo Land Resort, and the Shedd Aquarium. The ride features water squirts, real bubbles, and other sensory enhancements. In 2012, Nickelodeon teamed up again with SimEx-Iwerks Entertainment and Super 78 to produce SpongeBob SquarePants 4-D: The Great Jelly Rescue. The attraction opened in early 2013 at the Mystic Aquarium & Institute for Exploration. It was also installed at the Nickelodeon Suites Resort Orlando in Orlando, Florida. The seven-minute film follows SpongeBob, Patrick, and Sandy rescuing the jellyfish of Jellyfish Fields from Plankton's evil clutches. On May 23, 2015, an interactive 3D show titled SpongeBob SubPants Adventure opened in Texas at Moody Gardens. The show was replaced with a generic \"20,000 Leagues Under the Sea\" re-theming in 2019. A dark ride shooter attraction titled SpongeBob's Crazy Carnival Ride will open at the Circus Circus Resort in Las Vegas, Nevada in 2024. The ride's design and its animatronic of Mr. Krabs, dressed as a carnival barker, was unveiled at IAAPA Expo 2023.A variety of SpongeBob SquarePants-related attractions are currently located within Nickelodeon themed-areas at Movie Park Germany, Pleasure Beach Blackpool, Sea World, American Dream Meadowlands, and Mall of America, which includes the SpongeBob SquarePants Rock Bottom Plunge euro-fighter roller coaster.\n\n\n=== Video games ===\n\nNumerous video games based on the series have been produced. Some of the early games include: Legend of the Lost Spatula (2001) and SpongeBob SquarePants: Battle for Bikini Bottom (2003). In 2013, Nickelodeon published and distributed SpongeBob Moves In!, a freemium city-building game app developed by Kung Fu Factory for iOS and Android. On June 5, 2019, THQ Nordic announced SpongeBob SquarePants: Battle for Bikini Bottom – Rehydrated, a full remake of the console versions of the original 2003 game. The game was released 1 year later on June 23, 2020 and includes cut content from the original game. On May 28, 2020, Apple Arcade released a game called Spongebob Squarepants: Patty Pursuit. In 2021, EA Sports introduced a SpongeBob-themed level to the Yard section of its Madden NFL 21 video game.On September 17, 2021, THQ Nordic announced SpongeBob Squarepants: The Cosmic Shake, a new original game based on the franchise.\n\n\n=== SpongeBob SquareShorts ===\nNickelodeon launched the first global SpongeBob SquarePants-themed short film competition, SpongeBob SquareShorts: Original Fan Tributes, in 2013. The contest encouraged fans and filmmakers around the world to create original short films inspired by SpongeBob for a chance to win a prize and a trip for four people to a screening event in Hollywood. The contest opened on May 6 and ran through June 28, 2013. On July 19, 2013, Nickelodeon announced the competition's finalists. On August 13, 2013, the under 18 years of age category was won by David of the United States for his The Krabby Commercial, while the Finally Home short by Nicole of South Africa won the 18 and over category.\n\n\n=== Theater ===\n\nSpongeBob SquarePants was adapted as a stage musical in 2016 by director Tina Landau. SpongeBob SquarePants, The Broadway Musical premiered in Chicago in 2016 and opened on Broadway at the Palace Theatre on December 4, 2017. The musical opened to critical acclaim, and tied for most-nominated production at the 2018 72nd Tony Awards with twelve Tony nominations.\n\n\n== SpongeBob in internet culture ==\nOnline memes relating to SpongeBob SquarePants have achieved widespread popularity on the Internet, so much so that Vox's Aja Romano declared in 2019 that \"Spongebob memes came to rule internet culture.\" A subreddit devoted to memes based on the animated series has, as of May 2019, accumulated over 1.7 million subscribers, a figure exponentially higher than subreddits devoted to the series itself.Matt Schimkowitz, a senior editor for Know Your Meme, told Time that a combination of factors make SpongeBob memes so popular. He speculated that nostalgia for the past, alongside the cartoon's young audience, contributed to the SpongeBob Squarepants's outsized presence in Internet meme culture. Schimkowitz further added that memes derived from the series are exceptionally good at expressing emotions.Michael Gold of The New York Times concurred. The writer opined that because of the show's \"high episode count\" and that it was \"so ubiquitous at the beginning of the 21st century,\" SpongeBob SquarePants became \"easy meme fodder.\"Nickelodeon and members of the SpongeBob cast have expressed approval for the trend. Tom Kenny told Time that he found SpongeBob memes relatable and good-natured. Kenny said that while the show's characters can be considered complex, they are also simple, creating a wealth of content for meme creators to work with. Nickelodeon has manufactured a line of toys based on some of the show's most recognizable meme formats, and has even included references to well-known memes in video games.Among the show's most popular memes are the mocking SpongeBob meme, referring to an image macro from the episode \"Little Yellow Book\", an image of Spongebob appearing exhausted in the episode \"Nature Pants,\" and a particularly disheveled illustration of Squidward from \"Squid's Day Off.\"\n\n\n== Merchandise ==\n\nThe popularity of SpongeBob SquarePants inspired merchandise from T-shirts to posters. In 2009, it was reported that the franchise had generated an estimated $8 billion in merchandising revenue for Nickelodeon. The series is also the most distributed property of Paramount Media Networks. SpongeBob is viewed in 170 countries speaking 24 languages, and has become \"a killer merchandising app\". The title character and his friends have been used as a theme for special editions of well-known family board games, including Monopoly, Life, and Operation, as well as a SpongeBob SquarePants edition of Ants in the Pants, and Yahtzee.In 2001, Nickelodeon signed a marketing deal with Target Corporation and Burger King, expanding its merchandising. The popularity of SpongeBob has translated well into sales. In 2002, SpongeBob SquarePants dolls sold at a rate of 75,000 per week—faster than Tickle Me Elmo dolls were selling at the time. SpongeBob has gained popularity in Japan, specifically with Japanese women. Nickelodeon's parent company Viacom purposefully targeted marketing at women there. Skeptics initially doubted that SpongeBob could be popular in Japan, as the character's design is very different from already popular designs for Hello Kitty and Pikachu. Ratings and merchandise sales showed SpongeBob SquarePants has caught on with parents and with college audiences. In a 2013 promotion, college-oriented website Music.com gave away 80,000 SpongeBob T-shirts, four times more than during a similar promotion for Comedy Central's South Park.Kids' meal tie-ins have been released in fast food restaurants in many parts of the world, including Burger King in Europe and North America, as well as Wendy's in North America, and Hungry Jack's in Australia. A McDonald's Happy Meal tie-in with SpongeBob-themed Happy Meal boxes and toys was released in Europe and other international markets in the summer of 2007. In Australia, the advertisement for the McDonald's SpongeBob Happy Meal won the Pester Power Award because the ads enticed young children to want its food because of the free toy. As a tie-in beverage for the DVD release of The SpongeBob SquarePants Movie, 7-Eleven released the limited edition Under-the-Sea Pineapple Slurpee in March 2004. Pirate's Booty released limited edition SpongeBob SquarePants Pirate's Booty snacks in 2013.In 2007, high-end SpongeBob-themed electronics were introduced by Imation Electronics Products under the Npower brand, including MP3 players, digital cameras, a DVD player, and a flatscreen television. Pictures of SpongeBob SquarePants began to appear on the labels of 8 ounce cans of Green Giant cut green beans and packages of frozen Green Giant green beans and butter sauce in 2007, which featured free stickers. This was part of an initiative to encourage kids to eat their vegetables. The Simmons Jewelry Co. released a $75,000 diamond pendant as part of a SpongeBob collection. In New Zealand, the UK-based Beechdean Group unveiled the SpongeBob SquarePants Vanilla Ice Cream character product as part of a license deal with Nickelodeon. NZ Drinks launched the SpongeBob SquarePants bottled water.Build-A-Bear Workshop introduced the new SpongeBob SquarePants collection in stores and online in North America on May 17, 2013. Shoppers can dress their SpongeBob and Patrick plush in a variety of clothing and accessories. Sandy Cheeks and Gary the Snail are also available as pre-stuffed minis. Build-A-Bear Workshop stores nationwide celebrated the arrival of SpongeBob with a series of special events from May 17 through May 19.On July 13, 2013, Toyota, with Nickelodeon, unveiled a SpongeBob-inspired Toyota Highlander. The 2014 Toyota Highlander was launched on SpongeBob Day at the San Diego Padres v. Giants game. The SpongeBob Toyota Highlander visited seven U.S. locations during its release, including the Nickelodeon Suites Resort Orlando in Florida.In April 2019, Nickelodeon released a series of toys adapted from various SpongeBob Internet memes. These included \"Handsome Squidward\", \"Imaginaaation SpongeBob\", \"Mocking SpongeBob\", \"SpongeGar\", and \"Surprised Patrick\". Shortly after the release of the line, most of the toys sold out on Amazon.com.\n\n\n== See also ==\nKamp Koral: SpongeBob's Under Years\nThe Patrick Star Show\nRocko's Modern Life\n\n\n== Notes ==\n\n\n== References ==\n\n\n=== Bibliography ===\nBanks, Steven (September 24, 2004). SpongeBob Exposed! The Insider's Guide to SpongeBob SquarePants. Schigiel, Gregg (Illustrator). Simon Spotlight/Nickelodeon. ISBN 978-0-689-86870-2.\nBeck, Jerry (2013). The SpongeBob SquarePants Experience: A Deep Dive Into the World of Bikini Bottom. USA: Insight Editions. ISBN 978-1-4357-3248-3.\nNeuwirth, Allan (2003). Makin' Toons: Inside the Most Popular Animated TV Shows and Movies. Allworth Communications, Inc. ISBN 978-1-58115-269-2.\nPriebe, Kenneth A. (2011). The Advanced Art of Stop-Motion Animation. Cengage Learning. ISBN 978-1-4354-5704-1.\nLenburg, Jeff (2006). \"Hal Leonard\". Who's Who in Animated Cartoons: An International Guide to Film & Television's Award Winning and Legendary Animators. Rowman & Littlefield. ISBN 978-1-55783-671-7.\n\n\n== External links ==\n\n Quotations related to SpongeBob SquarePants at Wikiquote\n Media related to SpongeBob SquarePants at Wikimedia Commons\nOfficial website\nSpongeBob SquarePants at IMDb \nSpongeBob SquarePants at Curlie\nSpongeBob SquarePants at the Big Cartoon DataBase\nSpongeBob SquarePants at Don Markstein's Toonopedia. Archived from the original on August 8, 2017.", "language_style": "Whimsical, nonsensical, and optimistic"}